app/views/main/index.html.erb

</nav>
<%= content_tag "div", class: "to-listen", data: {artists: Artist.all} do %>
---
SELECT "artists".* FROM "artists"