app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    respond_with Artist.all

INSERT INTO "artists" ("listened", "name") VALUES (?, ?)  [["listened", "f"], ["name", "App"]]
---
  def create
    respond_with @artist.create(artist_params)

UPDATE "artists" SET "listened" = ? WHERE "artists"."id" = 54  [["listened", "t"]]
---
  def update
    respond_with @artist.update(artist_params)

DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 2]]
---
  def destroy
    respond_with @artist.destroy